In [1]:
import pandas as pd
import os

In [2]:
PATH = "../Datasets/Rainfall/"

In [3]:
titles = os.listdir(PATH)

Reading files

In [8]:
df = pd.read_excel(PATH + titles[0])

In [9]:
df

    Parámetro       Fecha  valor Unidad
0         NaN         NaN    NaN    NaN
1          PP  2018-04-11   0.04     mm
2          PP  2018-04-11   0.44     mm
3          PP  2018-04-11   0.03     mm
4          PP  2018-04-11   0.01     mm
..        ...         ...    ...    ...
799        PP  2020-02-05   0.10     mm
800        PP  2020-02-05   0.01     mm
801        PP  2020-02-05   0.02     mm
802        PP  2020-02-05   0.03     mm
803        PP  2020-02-05   0.04     mm

[804 rows x 4 columns]

Dropping empty instances

In [11]:
df.dropna(how='all', inplace=True)

In [12]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 803 entries, 1 to 803
Data columns (total 4 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   Parámetro  803 non-null    object
 1   Fecha      803 non-null    object
 2   valor      803 non-null    float64
 3   Unidad     803 non-null    object
dtypes: float64(1), object(3)
memory usage: 31.4+ KB

Creating the complete dataset

In [13]:
for df_i in titles[1:]:
    df_i = pd.read_excel(PATH + df_i)
    df_i = df_i.dropna(how='all')
    df = pd.concat([df, df_i], axis=0)

In [14]:
df

     Parámetro       Fecha  valor Unidad
1           PP  2018-04-11   0.04     mm
2           PP  2018-04-11   0.44     mm
3           PP  2018-04-11   0.03     mm
4           PP  2018-04-11   0.01     mm
5           PP  2018-04-12   0.02     mm
...        ...         ...    ...    ...
7360        PP  2025-03-09   0.00     mm
7361        PP  2025-03-09   0.00     mm
7362        PP  2025-03-09   0.00     mm
7363        PP  2025-03-09   0.00     mm
7364        PP  2025-03-09   0.00     mm

[23559 rows x 4 columns]

In [15]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 23559 entries, 1 to 7364
Data columns (total 4 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   Parámetro  23559 non-null  object
 1   Fecha      23559 non-null  object
 2   valor      23559 non-null  float64
 3   Unidad     23559 non-null  object
dtypes: float64(1), object(3)
memory usage: 920.3+ KB

Dropping unnecessary columns

In [16]:
df.drop(["Parámetro", "Unidad"], axis=1, inplace=True)

In [17]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 23559 entries, 1 to 7364
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Fecha   23559 non-null  object
 1   valor   23559 non-null  float64
dtypes: float64(1), object(1)
memory usage: 552.2+ KB

Formating dates

In [18]:
df["Fecha"] = pd.to_datetime(df["Fecha"])

In [19]:
df.head()

       Fecha  valor
1 2018-04-11   0.04
2 2018-04-11   0.44
3 2018-04-11   0.03
4 2018-04-11   0.01
5 2018-04-12   0.02

Changing column names

In [20]:
df.rename(columns={"valor":"Rainfall"}, inplace=True)

In [22]:
df

          Fecha  Rainfall
1    2018-04-11      0.04
2    2018-04-11      0.44
3    2018-04-11      0.03
4    2018-04-11      0.01
5    2018-04-12      0.02
...         ...       ...
7360 2025-03-09      0.00
7361 2025-03-09      0.00
7362 2025-03-09      0.00
7363 2025-03-09      0.00
7364 2025-03-09      0.00

[23559 rows x 2 columns]

Grouping per day and taking in consideration the sum

In [23]:
df = df.groupby("Fecha", as_index=False).sum()

In [25]:
df

          Fecha  Rainfall
0    2018-04-11      0.52
1    2018-04-12      0.02
2    2018-04-23      0.14
3    2018-04-24      0.38
4    2018-04-30      0.16
...         ...       ...
1394 2025-03-05      0.00
1395 2025-03-06      0.00
1396 2025-03-07      0.00
1397 2025-03-08      0.00
1398 2025-03-09      0.00

[1399 rows x 2 columns]

In [27]:
df.to_csv(PATH + "Rainfall.csv", index=False)